# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3 
import pandas as pd
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

In [3]:
def mysql(query):
    c.execute(str(query))
    df = pd.DataFrame(c.fetchall())
    df.columns = [x[0] for x in c.description]
    return df

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [4]:
#Your code here
mysql("""SELECT * FROM employees JOIN offices USING(officeCode) WHERE city == 'Boston'""")

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [5]:
#Your code here
mysql("""SELECT city, COUNT(*) FROM offices LEFT JOIN employees USING(officeCode) GROUP BY 1""")

            city  COUNT(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Write 3 Questions of your own and answer them

In [6]:
# Answers will vary
# 1.  Who are the customers for each employee?
# 2.  What's the quantity ordered for each product?
# 3.  What are the customer's order number?

In [14]:
# Your code here
mysql("""SELECT lastName, firstName, customerName FROM employees JOIN customers ON employees.lastName = customers.contactLastName;""")

    lastName firstName                  customerName
0     Murphy     Diane               Mini Wheels Co.
1     Murphy     Diane              Super Scale Inc.
2   Thompson    Leslie  Collectable Mini Designs Co.
3   Thompson    Leslie   West Coast Collectables Co.
4      Tseng  Foon Yue    Cambridge Collectables Co.
5  Hernandez    Gerard          Classic Legends Inc.
6  Hernandez    Gerard          Marta's Replicas Co.
7       King       Tom               Gift Depot Inc.
8       King       Tom            Signal Gift Stores

In [23]:
# Your code here
mysql("""SELECT productName, quantityOrdered FROM products JOIN orderdetails USING(productCode) GROUP BY productName ORDER BY quantityOrdered DESC LIMIT 10""")

                           productName quantityOrdered
0                   1969 Dodge Charger              97
1                 1969 Dodge Super Bee              90
2       America West Airlines B757-200              85
3              1970 Plymouth Hemi Cuda              77
4                   F/A 18 Hornet 1/72              77
5             1917 Grand Touring Sedan              76
6                   1949 Jaguar XK 120              76
7              1956 Porsche 356A Coupe              76
8             1962 Volkswagen Microbus              70
9  1932 Alfa Romeo 8C2300 Spider Sport              66

In [ ]:
# Your code here
mysql("""SELECT customerName, """)

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!